garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q71.h
// Register: U2RXPPS
#define U2RXPPS U2RXPPS
extern volatile unsigned char           U2RXPPS             __at(0x274);
#ifndef _LIB_BUILD
asm("U2RXPPS equ 0274h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned U2RXPPS0               :1;
        unsigned U2RXPPS1               :1;
        unsigned U2RXPPS2               :1;
        unsigned U2RXPPS3               :1;
        unsigned U2RXPPS4               :1;
        unsigned U2RXPPS5               :1;
    };
    struct {
        unsigned U2RXPPS                :6;
    };
} U2RXPPSbits_t;
extern volatile U2RXPPSbits_t U2RXPPSbits __at(0x274);
// bitfield macros
#define _U2RXPPS_PIN_POSN                                   0x0
#define _U2RXPPS_PIN_POSITION                               0x0
#define _U2RXPPS_PIN_SIZE                                   0x3
#define _U2RXPPS_PIN_LENGTH                                 0x3
#define _U2RXPPS_PIN_MASK                                   0x7
#define _U2RXPPS_PORT_POSN                                  0x3
#define _U2RXPPS_PORT_POSITION                              0x3
#define _U2RXPPS_PORT_SIZE                                  0x3
#define _U2RXPPS_PORT_LENGTH                                0x3
#define _U2RXPPS_PORT_MASK                                  0x38
#define _U2RXPPS_U2RXPPS0_POSN                              0x0
#define _U2RXPPS_U2RXPPS0_POSITION                          0x0
#define _U2RXPPS_U2RXPPS0_SIZE                              0x1
#define _U2RXPPS_U2RXPPS0_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS0_MASK                              0x1
#define _U2RXPPS_U2RXPPS1_POSN                              0x1
#define _U2RXPPS_U2RXPPS1_POSITION                          0x1
#define _U2RXPPS_U2RXPPS1_SIZE                              0x1
#define _U2RXPPS_U2RXPPS1_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS1_MASK                              0x2
#define _U2RXPPS_U2RXPPS2_POSN                              0x2
#define _U2RXPPS_U2RXPPS2_POSITION                          0x2
#define _U2RXPPS_U2RXPPS2_SIZE                              0x1
#define _U2RXPPS_U2RXPPS2_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS2_MASK                              0x4
#define _U2RXPPS_U2RXPPS3_POSN                              0x3
#define _U2RXPPS_U2RXPPS3_POSITION                          0x3
#define _U2RXPPS_U2RXPPS3_SIZE                              0x1
#define _U2RXPPS_U2RXPPS3_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS3_MASK                              0x8
#define _U2RXPPS_U2RXPPS4_POSN                              0x4
#define _U2RXPPS_U2RXPPS4_POSITION                          0x4
#define _U2RXPPS_U2RXPPS4_SIZE                              0x1
#define _U2RXPPS_U2RXPPS4_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS4_MASK                              0x10
#define _U2RXPPS_U2RXPPS5_POSN                              0x5
#define _U2RXPPS_U2RXPPS5_POSITION                          0x5
#define _U2RXPPS_U2RXPPS5_SIZE                              0x1
#define _U2RXPPS_U2RXPPS5_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS5_MASK                              0x20
#define _U2RXPPS_U2RXPPS_POSN                               0x0
#define _U2RXPPS_U2RXPPS_POSITION                           0x0
#define _U2RXPPS_U2RXPPS_SIZE                               0x6
#define _U2RXPPS_U2RXPPS_LENGTH                             0x6
#define _U2RXPPS_U2RXPPS_MASK                               0x3F

// Register: U2CTSPPS
#define U2CTSPPS U2CTSPPS
extern volatile unsigned char           U2CTSPPS            __at(0x275);
#ifndef _LIB_BUILD
asm("U2CTSPPS equ 0275h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned U2CTSPPS0              :1;
        unsigned U2CTSPPS1              :1;
        unsigned U2CTSPPS2              :1;
        unsigned U2CTSPPS3              :1;
        unsigned U2CTSPPS4              :1;
        unsigned U2CTSPPS5              :1;
    };
    struct {
        unsigned U2CTSPPS               :6;
    };
} U2CTSPPSbits_t;
extern volatile U2CTSPPSbits_t U2CTSPPSbits __at(0x275);
// bitfield macros
#define _U2CTSPPS_PIN_POSN                                  0x0
#define _U2CTSPPS_PIN_POSITION                              0x0
#define _U2CTSPPS_PIN_SIZE                                  0x3
#define _U2CTSPPS_PIN_LENGTH                                0x3
#define _U2CTSPPS_PIN_MASK                                  0x7
#define _U2CTSPPS_PORT_POSN                                 0x3
#define _U2CTSPPS_PORT_POSITION                             0x3
#define _U2CTSPPS_PORT_SIZE                                 0x3
#define _U2CTSPPS_PORT_LENGTH                               0x3
#define _U2CTSPPS_PORT_MASK                                 0x38
#define _U2CTSPPS_U2CTSPPS0_POSN                            0x0
#define _U2CTSPPS_U2CTSPPS0_POSITION                        0x0
#define _U2CTSPPS_U2CTSPPS0_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS0_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS0_MASK                            0x1
#define _U2CTSPPS_U2CTSPPS1_POSN                            0x1
#define _U2CTSPPS_U2CTSPPS1_POSITION                        0x1
#define _U2CTSPPS_U2CTSPPS1_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS1_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS1_MASK                            0x2
#define _U2CTSPPS_U2CTSPPS2_POSN                            0x2
#define _U2CTSPPS_U2CTSPPS2_POSITION                        0x2
#define _U2CTSPPS_U2CTSPPS2_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS2_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS2_MASK                            0x4
#define _U2CTSPPS_U2CTSPPS3_POSN                            0x3
#define _U2CTSPPS_U2CTSPPS3_POSITION                        0x3
#define _U2CTSPPS_U2CTSPPS3_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS3_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS3_MASK                            0x8
#define _U2CTSPPS_U2CTSPPS4_POSN                            0x4
#define _U2CTSPPS_U2CTSPPS4_POSITION                        0x4
#define _U2CTSPPS_U2CTSPPS4_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS4_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS4_MASK                            0x10
#define _U2CTSPPS_U2CTSPPS5_POSN                            0x5
#define _U2CTSPPS_U2CTSPPS5_POSITION                        0x5
#define _U2CTSPPS_U2CTSPPS5_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS5_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS5_MASK                            0x20
#define _U2CTSPPS_U2CTSPPS_POSN                             0x0
#define _U2CTSPPS_U2CTSPPS_POSITION                         0x0
#define _U2CTSPPS_U2CTSPPS_SIZE                             0x6
#define _U2CTSPPS_U2CTSPPS_LENGTH                           0x6
#define _U2CTSPPS_U2CTSPPS_MASK                             0x3F

// Register: OPA1ORPPS
#define OPA1ORPPS OPA1ORPPS
extern volatile unsigned char           OPA1ORPPS           __at(0x276);
#ifndef _LIB_BUILD
asm("OPA1ORPPS equ 0276h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned OPA1PPS0               :1;
        unsigned OPA1PPS1               :1;
        unsigned OPA1PPS2               :1;
        unsigned OPA1PPS3               :1;
        unsigned OPA1PPS4               :1;
        unsigned OPA1PPS5               :1;
    };
    struct {
        unsigned OPA1PPS                :6;
    };
} OPA1ORPPSbits_t;
extern volatile OPA1ORPPSbits_t OPA1ORPPSbits __at(0x276);
// bitfield macros
#define _OPA1ORPPS_PIN_POSN                                 0x0
#define _OPA1ORPPS_PIN_POSITION                             0x0
#define _OPA1ORPPS_PIN_SIZE                                 0x3
#define _OPA1ORPPS_PIN_LENGTH                               0x3
#define _OPA1ORPPS_PIN_MASK                                 0x7
#define _OPA1ORPPS_PORT_POSN                                0x3
#define _OPA1ORPPS_PORT_POSITION                            0x3
#define _OPA1ORPPS_PORT_SIZE                                0x3
#define _OPA1ORPPS_PORT_LENGTH                              0x3
#define _OPA1ORPPS_PORT_MASK                                0x38
#define _OPA1ORPPS_OPA1PPS0_POSN                            0x0
#define _OPA1ORPPS_OPA1PPS0_POSITION                        0x0
#define _OPA1ORPPS_OPA1PPS0_SIZE                            0x1
#define _OPA1ORPPS_OPA1PPS0_LENGTH                          0x1
#define _OPA1ORPPS_OPA1PPS0_MASK                            0x1
#define _OPA1ORPPS_OPA1PPS1_POSN                            0x1
#define _OPA1ORPPS_OPA1PPS1_POSITION                        0x1
#define _OPA1ORPPS_OPA1PPS1_SIZE                            0x1
#define _OPA1ORPPS_OPA1PPS1_LENGTH                          0x1
#define _OPA1ORPPS_OPA1PPS1_MASK                            0x2
#define _OPA1ORPPS_OPA1PPS2_POSN                            0x2
#define _OPA1ORPPS_OPA1PPS2_POSITION                        0x2
#define _OPA1ORPPS_OPA1PPS2_SIZE                            0x1
#define _OPA1ORPPS_OPA1PPS2_LENGTH                          0x1
#define _OPA1ORPPS_OPA1PPS2_MASK                            0x4
#define _OPA1ORPPS_OPA1PPS3_POSN                            0x3
#define _OPA1ORPPS_OPA1PPS3_POSITION                        0x3
#define _OPA1ORPPS_OPA1PPS3_SIZE                            0x1
#define _OPA1ORPPS_OPA1PPS3_LENGTH                          0x1
#define _OPA1ORPPS_OPA1PPS3_MASK                            0x8
#define _OPA1ORPPS_OPA1PPS4_POSN                            0x4
#define _OPA1ORPPS_OPA1PPS4_POSITION                        0x4
#define _OPA1ORPPS_OPA1PPS4_SIZE                            0x1
#define _OPA1ORPPS_OPA1PPS4_LENGTH                          0x1
#define _OPA1ORPPS_OPA1PPS4_MASK                            0x10
#define _OPA1ORPPS_OPA1PPS5_POSN                            0x5
#define _OPA1ORPPS_OPA1PPS5_POSITION                        0x5
#define _OPA1ORPPS_OPA1PPS5_SIZE                            0x1
#define _OPA1ORPPS_OPA1PPS5_LENGTH                          0x1
#define _OPA1ORPPS_OPA1PPS5_MASK                            0x20
#define _OPA1ORPPS_OPA1PPS_POSN                             0x0
#define _OPA1ORPPS_OPA1PPS_POSITION                         0x0
#define _OPA1ORPPS_OPA1PPS_SIZE                             0x6
#define _OPA1ORPPS_OPA1PPS_LENGTH                           0x6
#define _OPA1ORPPS_OPA1PPS_MASK                             0x3F

// Register: OPA2ORPPS
#define OPA2ORPPS OPA2ORPPS
extern volatile unsigned char           OPA2ORPPS           __at(0x277);
#ifndef _LIB_BUILD
asm("OPA2ORPPS equ 0277h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned OPA2PPS0               :1;
        unsigned OPA2PPS1               :1;
        unsigned OPA2PPS2               :1;
        unsigned OPA2PPS3               :1;
        unsigned OPA2PPS4               :1;
        unsigned OPA2PPS5               :1;
    };
    struct {
        unsigned OPA2PPS                :6;
    };
} OPA2ORPPSbits_t;
