garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q71.h
// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0x4AD);
#ifndef _LIB_BUILD
asm("PIE6 equ 04ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IE                 :1;
        unsigned CLC7IE                 :1;
        unsigned CWG1IE                 :1;
        unsigned NCO1IE                 :1;
        unsigned DMA2SCNTIE             :1;
        unsigned DMA2DCNTIE             :1;
        unsigned DMA2ORIE               :1;
        unsigned DMA2AIE                :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0x4AD);
// bitfield macros
#define _PIE6_INT1IE_POSN                                   0x0
#define _PIE6_INT1IE_POSITION                               0x0
#define _PIE6_INT1IE_SIZE                                   0x1
#define _PIE6_INT1IE_LENGTH                                 0x1
#define _PIE6_INT1IE_MASK                                   0x1
#define _PIE6_CLC7IE_POSN                                   0x1
#define _PIE6_CLC7IE_POSITION                               0x1
#define _PIE6_CLC7IE_SIZE                                   0x1
#define _PIE6_CLC7IE_LENGTH                                 0x1
#define _PIE6_CLC7IE_MASK                                   0x2
#define _PIE6_CWG1IE_POSN                                   0x2
#define _PIE6_CWG1IE_POSITION                               0x2
#define _PIE6_CWG1IE_SIZE                                   0x1
#define _PIE6_CWG1IE_LENGTH                                 0x1
#define _PIE6_CWG1IE_MASK                                   0x4
#define _PIE6_NCO1IE_POSN                                   0x3
#define _PIE6_NCO1IE_POSITION                               0x3
#define _PIE6_NCO1IE_SIZE                                   0x1
#define _PIE6_NCO1IE_LENGTH                                 0x1
#define _PIE6_NCO1IE_MASK                                   0x8
#define _PIE6_DMA2SCNTIE_POSN                               0x4
#define _PIE6_DMA2SCNTIE_POSITION                           0x4
#define _PIE6_DMA2SCNTIE_SIZE                               0x1
#define _PIE6_DMA2SCNTIE_LENGTH                             0x1
#define _PIE6_DMA2SCNTIE_MASK                               0x10
#define _PIE6_DMA2DCNTIE_POSN                               0x5
#define _PIE6_DMA2DCNTIE_POSITION                           0x5
#define _PIE6_DMA2DCNTIE_SIZE                               0x1
#define _PIE6_DMA2DCNTIE_LENGTH                             0x1
#define _PIE6_DMA2DCNTIE_MASK                               0x20
#define _PIE6_DMA2ORIE_POSN                                 0x6
#define _PIE6_DMA2ORIE_POSITION                             0x6
#define _PIE6_DMA2ORIE_SIZE                                 0x1
#define _PIE6_DMA2ORIE_LENGTH                               0x1
#define _PIE6_DMA2ORIE_MASK                                 0x40
#define _PIE6_DMA2AIE_POSN                                  0x7
#define _PIE6_DMA2AIE_POSITION                              0x7
#define _PIE6_DMA2AIE_SIZE                                  0x1
#define _PIE6_DMA2AIE_LENGTH                                0x1
#define _PIE6_DMA2AIE_MASK                                  0x80

// Register: PIE7
#define PIE7 PIE7
extern volatile unsigned char           PIE7                __at(0x4AE);
#ifndef _LIB_BUILD
asm("PIE7 equ 04AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1RXIE               :1;
        unsigned I2C1TXIE               :1;
        unsigned I2C1IE                 :1;
        unsigned I2C1EIE                :1;
        unsigned                        :1;
        unsigned CLC3IE                 :1;
        unsigned PWM3PIE                :1;
        unsigned PWM3IE                 :1;
    };
} PIE7bits_t;
extern volatile PIE7bits_t PIE7bits __at(0x4AE);
// bitfield macros
#define _PIE7_I2C1RXIE_POSN                                 0x0
#define _PIE7_I2C1RXIE_POSITION                             0x0
#define _PIE7_I2C1RXIE_SIZE                                 0x1
#define _PIE7_I2C1RXIE_LENGTH                               0x1
#define _PIE7_I2C1RXIE_MASK                                 0x1
#define _PIE7_I2C1TXIE_POSN                                 0x1
#define _PIE7_I2C1TXIE_POSITION                             0x1
#define _PIE7_I2C1TXIE_SIZE                                 0x1
#define _PIE7_I2C1TXIE_LENGTH                               0x1
#define _PIE7_I2C1TXIE_MASK                                 0x2
#define _PIE7_I2C1IE_POSN                                   0x2
#define _PIE7_I2C1IE_POSITION                               0x2
#define _PIE7_I2C1IE_SIZE                                   0x1
#define _PIE7_I2C1IE_LENGTH                                 0x1
#define _PIE7_I2C1IE_MASK                                   0x4
#define _PIE7_I2C1EIE_POSN                                  0x3
#define _PIE7_I2C1EIE_POSITION                              0x3
#define _PIE7_I2C1EIE_SIZE                                  0x1
#define _PIE7_I2C1EIE_LENGTH                                0x1
#define _PIE7_I2C1EIE_MASK                                  0x8
#define _PIE7_CLC3IE_POSN                                   0x5
#define _PIE7_CLC3IE_POSITION                               0x5
#define _PIE7_CLC3IE_SIZE                                   0x1
#define _PIE7_CLC3IE_LENGTH                                 0x1
#define _PIE7_CLC3IE_MASK                                   0x20
#define _PIE7_PWM3PIE_POSN                                  0x6
#define _PIE7_PWM3PIE_POSITION                              0x6
#define _PIE7_PWM3PIE_SIZE                                  0x1
#define _PIE7_PWM3PIE_LENGTH                                0x1
#define _PIE7_PWM3PIE_MASK                                  0x40
#define _PIE7_PWM3IE_POSN                                   0x7
#define _PIE7_PWM3IE_POSITION                               0x7
#define _PIE7_PWM3IE_SIZE                                   0x1
#define _PIE7_PWM3IE_LENGTH                                 0x1
#define _PIE7_PWM3IE_MASK                                   0x80

// Register: PIE8
#define PIE8 PIE8
extern volatile unsigned char           PIE8                __at(0x4AF);
#ifndef _LIB_BUILD
asm("PIE8 equ 04AFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXIE                 :1;
        unsigned U2TXIE                 :1;
        unsigned U2EIE                  :1;
        unsigned U2IE                   :1;
        unsigned                        :1;
        unsigned CLC4IE                 :1;
        unsigned CCP2IE                 :1;
        unsigned SCANIE                 :1;
    };
} PIE8bits_t;
extern volatile PIE8bits_t PIE8bits __at(0x4AF);
// bitfield macros
#define _PIE8_U2RXIE_POSN                                   0x0
#define _PIE8_U2RXIE_POSITION                               0x0
#define _PIE8_U2RXIE_SIZE                                   0x1
#define _PIE8_U2RXIE_LENGTH                                 0x1
#define _PIE8_U2RXIE_MASK                                   0x1
#define _PIE8_U2TXIE_POSN                                   0x1
#define _PIE8_U2TXIE_POSITION                               0x1
#define _PIE8_U2TXIE_SIZE                                   0x1
#define _PIE8_U2TXIE_LENGTH                                 0x1
#define _PIE8_U2TXIE_MASK                                   0x2
#define _PIE8_U2EIE_POSN                                    0x2
#define _PIE8_U2EIE_POSITION                                0x2
#define _PIE8_U2EIE_SIZE                                    0x1
#define _PIE8_U2EIE_LENGTH                                  0x1
#define _PIE8_U2EIE_MASK                                    0x4
#define _PIE8_U2IE_POSN                                     0x3
#define _PIE8_U2IE_POSITION                                 0x3
#define _PIE8_U2IE_SIZE                                     0x1
#define _PIE8_U2IE_LENGTH                                   0x1
#define _PIE8_U2IE_MASK                                     0x8
#define _PIE8_CLC4IE_POSN                                   0x5
#define _PIE8_CLC4IE_POSITION                               0x5
#define _PIE8_CLC4IE_SIZE                                   0x1
#define _PIE8_CLC4IE_LENGTH                                 0x1
#define _PIE8_CLC4IE_MASK                                   0x20
#define _PIE8_CCP2IE_POSN                                   0x6
#define _PIE8_CCP2IE_POSITION                               0x6
#define _PIE8_CCP2IE_SIZE                                   0x1
#define _PIE8_CCP2IE_LENGTH                                 0x1
#define _PIE8_CCP2IE_MASK                                   0x40
#define _PIE8_SCANIE_POSN                                   0x7
#define _PIE8_SCANIE_POSITION                               0x7
#define _PIE8_SCANIE_SIZE                                   0x1
#define _PIE8_SCANIE_LENGTH                                 0x1
#define _PIE8_SCANIE_MASK                                   0x80

// Register: PIE9
#define PIE9 PIE9
extern volatile unsigned char           PIE9                __at(0x4B0);
#ifndef _LIB_BUILD
asm("PIE9 equ 04B0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned DMA3SCNTIE             :1;
        unsigned DMA3DCNTIE             :1;
        unsigned DMA3ORIE               :1;
        unsigned DMA3AIE                :1;
    };
} PIE9bits_t;
