garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q71.h
#define                                 DMAnDSAL_DMA3       0x4135
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA3       0x4136
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA3      0x4137
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA3      0x4138
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA3      0x4139
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA3      0x413A
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA3      0x413B
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA3       0x413C
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA3       0x413D
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA3       0x413E
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA3       0x413F
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA3       0x4140
// Register: DMAnCON0
#define                                 DMAnCON0_DMA3       0x4141
// Register: DMAnCON1
#define                                 DMAnCON1_DMA3       0x4142
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA3       0x4143
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA3       0x4144
// Register: DMAnBUF
#define                                 DMAnBUF_DMA4        0x4145
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA4      0x4146
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA4      0x4147
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA4      0x4148
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA4      0x4149
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA4       0x414A
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA4       0x414B
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA4       0x414C
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA4       0x414D
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA4      0x414E
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA4      0x414F
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA4      0x4150
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA4      0x4151
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA4      0x4152
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA4       0x4153
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA4       0x4154
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA4       0x4155
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA4       0x4156
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA4       0x4157
// Register: DMAnCON0
#define                                 DMAnCON0_DMA4       0x4158
// Register: DMAnCON1
#define                                 DMAnCON1_DMA4       0x4159
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA4       0x415A
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA4       0x415B
// Register: IOCAF
#define                                 IOCAF_M1            0x41E0
// Register: IOCBF
#define                                 IOCBF_M1            0x41E1
// Register: IOCCF
#define                                 IOCCF_M1            0x41E2
// Register: IOCEF
#define                                 IOCEF_M1            0x41E3
// Register: IOCWF
#define                                 IOCWF_M1            0x41E4
// Register: TU16APRL
#define                                 TU16APRL_M1         0x41F0
// Register: TU16APRH
#define                                 TU16APRH_M1         0x41F1
// Register: TU16BPRL
#define                                 TU16BPRL_M1         0x41F2
// Register: TU16BPRH
#define                                 TU16BPRH_M1         0x41F3
// Register: TMR1L
#define                                 TMR1L_M1            0x41F6
// Register: TMR1H
#define                                 TMR1H_M1            0x41F7
// Register: TMR3L
#define                                 TMR3L_M1            0x41F8
// Register: TMR3H
#define                                 TMR3H_M1            0x41F9
/*
 * Device Information Area (DIA) Table
 */
extern const unsigned char              _DIA[64]            __at(0x2C0000);

extern const unsigned short             _DIA_MUI[8]         __at(0x2C0000);
#define DIA_MUI                                             0x2C0000
extern const unsigned short             _DIA_MUI0           __at(0x2C0000);
#define DIA_MUI0                                            0x2C0000
extern const unsigned short             _DIA_MUI1           __at(0x2C0002);
#define DIA_MUI1                                            0x2C0002
extern const unsigned short             _DIA_MUI2           __at(0x2C0004);
#define DIA_MUI2                                            0x2C0004
extern const unsigned short             _DIA_MUI3           __at(0x2C0006);
#define DIA_MUI3                                            0x2C0006
extern const unsigned short             _DIA_MUI4           __at(0x2C0008);
#define DIA_MUI4                                            0x2C0008
extern const unsigned short             _DIA_MUI5           __at(0x2C000A);
#define DIA_MUI5                                            0x2C000A
extern const unsigned short             _DIA_MUI6           __at(0x2C000C);
#define DIA_MUI6                                            0x2C000C
extern const unsigned short             _DIA_MUI7           __at(0x2C000E);
#define DIA_MUI7                                            0x2C000E

extern const unsigned short             _DIA_EUI[10]        __at(0x2C0010);
#define DIA_EUI                                             0x2C0010
extern const unsigned short             _DIA_EUI0           __at(0x2C0010);
#define DIA_EUI0                                            0x2C0010
extern const unsigned short             _DIA_EUI1           __at(0x2C0012);
#define DIA_EUI1                                            0x2C0012
extern const unsigned short             _DIA_EUI2           __at(0x2C0014);
#define DIA_EUI2                                            0x2C0014
extern const unsigned short             _DIA_EUI3           __at(0x2C0016);
#define DIA_EUI3                                            0x2C0016
extern const unsigned short             _DIA_EUI4           __at(0x2C0018);
#define DIA_EUI4                                            0x2C0018
extern const unsigned short             _DIA_EUI5           __at(0x2C001A);
#define DIA_EUI5                                            0x2C001A
extern const unsigned short             _DIA_EUI6           __at(0x2C001C);
#define DIA_EUI6                                            0x2C001C
extern const unsigned short             _DIA_EUI7           __at(0x2C001E);
#define DIA_EUI7                                            0x2C001E
extern const unsigned short             _DIA_EUI8           __at(0x2C0020);
#define DIA_EUI8                                            0x2C0020
extern const unsigned short             _DIA_EUI9           __at(0x2C0022);
#define DIA_EUI9                                            0x2C0022

