garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q71.h
extern const unsigned short             _DIA_TSLR[3]        __at(0x2C0024);
#define DIA_TSLR                                            0x2C0024
extern const unsigned short             _DIA_TSLR1          __at(0x2C0024);
#define DIA_TSLR1                                           0x2C0024
extern const unsigned short             _DIA_TSLR2          __at(0x2C0026);
#define DIA_TSLR2                                           0x2C0026
extern const unsigned short             _DIA_TSLR3          __at(0x2C0028);
#define DIA_TSLR3                                           0x2C0028

extern const unsigned short             _DIA_TSHR[3]        __at(0x2C002A);
#define DIA_TSHR                                            0x2C002A
extern const unsigned short             _DIA_TSHR1          __at(0x2C002A);
#define DIA_TSHR1                                           0x2C002A
extern const unsigned short             _DIA_TSHR2          __at(0x2C002C);
#define DIA_TSHR2                                           0x2C002C
extern const unsigned short             _DIA_TSHR3          __at(0x2C002E);
#define DIA_TSHR3                                           0x2C002E

extern const unsigned short             _DIA_FVRA[3]        __at(0x2C0030);
#define DIA_FVRA                                            0x2C0030
extern const unsigned short             _DIA_FVRA1X         __at(0x2C0030);
#define DIA_FVRA1X                                          0x2C0030
extern const unsigned short             _DIA_FVRA2X         __at(0x2C0032);
#define DIA_FVRA2X                                          0x2C0032
extern const unsigned short             _DIA_FVRA4X         __at(0x2C0034);
#define DIA_FVRA4X                                          0x2C0034

extern const unsigned short             _DIA_FVRC[3]        __at(0x2C0036);
#define DIA_FVRC                                            0x2C0036
extern const unsigned short             _DIA_FVRC1X         __at(0x2C0036);
#define DIA_FVRC1X                                          0x2C0036
extern const unsigned short             _DIA_FVRC2X         __at(0x2C0038);
#define DIA_FVRC2X                                          0x2C0038
extern const unsigned short             _DIA_FVRC4X         __at(0x2C003A);
#define DIA_FVRC4X                                          0x2C003A

/*
 * Device Configuration Information (DCI) Table
 */
extern const unsigned char              _DCI[10]            __at(0x3C0000);

extern const unsigned short             _DCI_ERSIZ          __at(0x3C0000);
#define DCI_ERSIZ                                           0x3C0000
extern const unsigned short             _DCI_WLSIZ          __at(0x3C0002);
#define DCI_WLSIZ                                           0x3C0002
extern const unsigned short             _DCI_URSIZ          __at(0x3C0004);
#define DCI_URSIZ                                           0x3C0004
extern const unsigned short             _DCI_EESIZ          __at(0x3C0006);
#define DCI_EESIZ                                           0x3C0006
extern const unsigned short             _DCI_PCNT           __at(0x3C0008);
#define DCI_PCNT                                            0x3C0008

/*
 * Configuration and ID Registers
 */
extern const unsigned char              _CONFIGs[11]        __at(0x300000);
// Register: CONFIG1
extern const unsigned char              _CONFIG1            __at(0x300000);
// bitfield definitions
typedef union {
    struct {
        unsigned FEXTOSC                :3;
        unsigned                        :1;
        unsigned RSTOSC                 :3;
    };
} _CONFIG1bits_t;
extern const _CONFIG1bits_t _CONFIG1bits __at(0x300000);

// Register: CONFIG2
extern const unsigned char              _CONFIG2            __at(0x300001);
// bitfield definitions
typedef union {
    struct {
        unsigned CLKOUTEN               :1;
        unsigned PR1WAY                 :1;
        unsigned BBEN                   :1;
        unsigned CSWEN                  :1;
        unsigned                        :1;
        unsigned FCMEN                  :1;
        unsigned FCMENP                 :1;
        unsigned FCMENS                 :1;
    };
} _CONFIG2bits_t;
extern const _CONFIG2bits_t _CONFIG2bits __at(0x300001);

// Register: CONFIG3
extern const unsigned char              _CONFIG3            __at(0x300002);
// bitfield definitions
typedef union {
    struct {
        unsigned MCLRE                  :1;
        unsigned PWRTS                  :2;
        unsigned MVECEN                 :1;
        unsigned IVT1WAY                :1;
        unsigned LPBOREN                :1;
        unsigned BOREN                  :2;
    };
} _CONFIG3bits_t;
extern const _CONFIG3bits_t _CONFIG3bits __at(0x300002);

// Register: CONFIG4
extern const unsigned char              _CONFIG4            __at(0x300003);
// bitfield definitions
typedef union {
    struct {
        unsigned BORV                   :2;
        unsigned ZCD                    :1;
        unsigned PPS1WAY                :1;
        unsigned STVREN                 :1;
        unsigned LVP                    :1;
        unsigned _DEBUG                 :1;
        unsigned XINST                  :1;
    };
} _CONFIG4bits_t;
extern const _CONFIG4bits_t _CONFIG4bits __at(0x300003);

// Register: CONFIG5
extern const unsigned char              _CONFIG5            __at(0x300004);
// bitfield definitions
typedef union {
    struct {
        unsigned WDTCPS                 :5;
        unsigned WDTE                   :2;
    };
} _CONFIG5bits_t;
extern const _CONFIG5bits_t _CONFIG5bits __at(0x300004);

// Register: CONFIG6
extern const unsigned char              _CONFIG6            __at(0x300005);
// bitfield definitions
typedef union {
    struct {
        unsigned WDTCWS                 :3;
        unsigned WDTCCS                 :3;
    };
} _CONFIG6bits_t;
extern const _CONFIG6bits_t _CONFIG6bits __at(0x300005);

// Register: CONFIG7
extern const unsigned char              _CONFIG7            __at(0x300006);
// bitfield definitions
typedef union {
    struct {
        unsigned BBSIZE                 :8;
    };
} _CONFIG7bits_t;
