garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q71.h
#define                                 TU16ACR11_bit       _BIT_ACCESS(TU16ACRH,3)
// TU16ACRH<TU16ACR12>
extern volatile __bit                   TU16ACR12           __at(0x1D2C);	// @ (0x3A5 * 8 + 4)
#define                                 TU16ACR12_bit       _BIT_ACCESS(TU16ACRH,4)
// TU16ACRH<TU16ACR13>
extern volatile __bit                   TU16ACR13           __at(0x1D2D);	// @ (0x3A5 * 8 + 5)
#define                                 TU16ACR13_bit       _BIT_ACCESS(TU16ACRH,5)
// TU16ACRH<TU16ACR14>
extern volatile __bit                   TU16ACR14           __at(0x1D2E);	// @ (0x3A5 * 8 + 6)
#define                                 TU16ACR14_bit       _BIT_ACCESS(TU16ACRH,6)
// TU16ACRH<TU16ACR15>
extern volatile __bit                   TU16ACR15           __at(0x1D2F);	// @ (0x3A5 * 8 + 7)
#define                                 TU16ACR15_bit       _BIT_ACCESS(TU16ACRH,7)
// TU16ACRL<TU16ACR2>
extern volatile __bit                   TU16ACR2            __at(0x1D22);	// @ (0x3A4 * 8 + 2)
#define                                 TU16ACR2_bit        _BIT_ACCESS(TU16ACRL,2)
// TU16ACRL<TU16ACR3>
extern volatile __bit                   TU16ACR3            __at(0x1D23);	// @ (0x3A4 * 8 + 3)
#define                                 TU16ACR3_bit        _BIT_ACCESS(TU16ACRL,3)
// TU16ACRL<TU16ACR4>
extern volatile __bit                   TU16ACR4            __at(0x1D24);	// @ (0x3A4 * 8 + 4)
#define                                 TU16ACR4_bit        _BIT_ACCESS(TU16ACRL,4)
// TU16ACRL<TU16ACR5>
extern volatile __bit                   TU16ACR5            __at(0x1D25);	// @ (0x3A4 * 8 + 5)
#define                                 TU16ACR5_bit        _BIT_ACCESS(TU16ACRL,5)
// TU16ACRL<TU16ACR6>
extern volatile __bit                   TU16ACR6            __at(0x1D26);	// @ (0x3A4 * 8 + 6)
#define                                 TU16ACR6_bit        _BIT_ACCESS(TU16ACRL,6)
// TU16ACRL<TU16ACR7>
extern volatile __bit                   TU16ACR7            __at(0x1D27);	// @ (0x3A4 * 8 + 7)
#define                                 TU16ACR7_bit        _BIT_ACCESS(TU16ACRL,7)
// TU16ACRH<TU16ACR8>
extern volatile __bit                   TU16ACR8            __at(0x1D28);	// @ (0x3A5 * 8 + 0)
#define                                 TU16ACR8_bit        _BIT_ACCESS(TU16ACRH,0)
// TU16ACRH<TU16ACR9>
extern volatile __bit                   TU16ACR9            __at(0x1D29);	// @ (0x3A5 * 8 + 1)
#define                                 TU16ACR9_bit        _BIT_ACCESS(TU16ACRH,1)
// TU16ACRH<TU16ACRH0>
extern volatile __bit                   TU16ACRH0           __at(0x1D28);	// @ (0x3A5 * 8 + 0)
#define                                 TU16ACRH0_bit       _BIT_ACCESS(TU16ACRH,0)
// TU16ACRH<TU16ACRH1>
extern volatile __bit                   TU16ACRH1           __at(0x1D29);	// @ (0x3A5 * 8 + 1)
#define                                 TU16ACRH1_bit       _BIT_ACCESS(TU16ACRH,1)
// TU16ACRH<TU16ACRH2>
extern volatile __bit                   TU16ACRH2           __at(0x1D2A);	// @ (0x3A5 * 8 + 2)
#define                                 TU16ACRH2_bit       _BIT_ACCESS(TU16ACRH,2)
// TU16ACRH<TU16ACRH3>
extern volatile __bit                   TU16ACRH3           __at(0x1D2B);	// @ (0x3A5 * 8 + 3)
#define                                 TU16ACRH3_bit       _BIT_ACCESS(TU16ACRH,3)
// TU16ACRH<TU16ACRH4>
extern volatile __bit                   TU16ACRH4           __at(0x1D2C);	// @ (0x3A5 * 8 + 4)
#define                                 TU16ACRH4_bit       _BIT_ACCESS(TU16ACRH,4)
// TU16ACRH<TU16ACRH5>
extern volatile __bit                   TU16ACRH5           __at(0x1D2D);	// @ (0x3A5 * 8 + 5)
#define                                 TU16ACRH5_bit       _BIT_ACCESS(TU16ACRH,5)
// TU16ACRH<TU16ACRH6>
extern volatile __bit                   TU16ACRH6           __at(0x1D2E);	// @ (0x3A5 * 8 + 6)
#define                                 TU16ACRH6_bit       _BIT_ACCESS(TU16ACRH,6)
// TU16ACRH<TU16ACRH7>
extern volatile __bit                   TU16ACRH7           __at(0x1D2F);	// @ (0x3A5 * 8 + 7)
#define                                 TU16ACRH7_bit       _BIT_ACCESS(TU16ACRH,7)
// TU16ACRL<TU16ACRL0>
extern volatile __bit                   TU16ACRL0           __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 TU16ACRL0_bit       _BIT_ACCESS(TU16ACRL,0)
// TU16ACRL<TU16ACRL1>
extern volatile __bit                   TU16ACRL1           __at(0x1D21);	// @ (0x3A4 * 8 + 1)
#define                                 TU16ACRL1_bit       _BIT_ACCESS(TU16ACRL,1)
// TU16ACRL<TU16ACRL2>
extern volatile __bit                   TU16ACRL2           __at(0x1D22);	// @ (0x3A4 * 8 + 2)
#define                                 TU16ACRL2_bit       _BIT_ACCESS(TU16ACRL,2)
// TU16ACRL<TU16ACRL3>
extern volatile __bit                   TU16ACRL3           __at(0x1D23);	// @ (0x3A4 * 8 + 3)
#define                                 TU16ACRL3_bit       _BIT_ACCESS(TU16ACRL,3)
// TU16ACRL<TU16ACRL4>
extern volatile __bit                   TU16ACRL4           __at(0x1D24);	// @ (0x3A4 * 8 + 4)
#define                                 TU16ACRL4_bit       _BIT_ACCESS(TU16ACRL,4)
// TU16ACRL<TU16ACRL5>
extern volatile __bit                   TU16ACRL5           __at(0x1D25);	// @ (0x3A4 * 8 + 5)
#define                                 TU16ACRL5_bit       _BIT_ACCESS(TU16ACRL,5)
// TU16ACRL<TU16ACRL6>
extern volatile __bit                   TU16ACRL6           __at(0x1D26);	// @ (0x3A4 * 8 + 6)
#define                                 TU16ACRL6_bit       _BIT_ACCESS(TU16ACRL,6)
// TU16ACRL<TU16ACRL7>
extern volatile __bit                   TU16ACRL7           __at(0x1D27);	// @ (0x3A4 * 8 + 7)
#define                                 TU16ACRL7_bit       _BIT_ACCESS(TU16ACRL,7)
// TU16AHLT<TU16ACSYNC>
extern volatile __bit                   TU16ACSYNC          __at(0x1D16);	// @ (0x3A2 * 8 + 6)
#define                                 TU16ACSYNC_bit      _BIT_ACCESS(TU16AHLT,6)
// TU16AHLT<TU16AEPOL>
extern volatile __bit                   TU16AEPOL           __at(0x1D17);	// @ (0x3A2 * 8 + 7)
#define                                 TU16AEPOL_bit       _BIT_ACCESS(TU16AHLT,7)
// TU16AERS<TU16AERS0>
extern volatile __bit                   TU16AERS0           __at(0x1D48);	// @ (0x3A9 * 8 + 0)
#define                                 TU16AERS0_bit       _BIT_ACCESS(TU16AERS,0)
// TU16AERS<TU16AERS1>
extern volatile __bit                   TU16AERS1           __at(0x1D49);	// @ (0x3A9 * 8 + 1)
#define                                 TU16AERS1_bit       _BIT_ACCESS(TU16AERS,1)
// TU16AERS<TU16AERS2>
extern volatile __bit                   TU16AERS2           __at(0x1D4A);	// @ (0x3A9 * 8 + 2)
#define                                 TU16AERS2_bit       _BIT_ACCESS(TU16AERS,2)
// TU16AERS<TU16AERS3>
extern volatile __bit                   TU16AERS3           __at(0x1D4B);	// @ (0x3A9 * 8 + 3)
#define                                 TU16AERS3_bit       _BIT_ACCESS(TU16AERS,3)
// TU16AERS<TU16AERS4>
extern volatile __bit                   TU16AERS4           __at(0x1D4C);	// @ (0x3A9 * 8 + 4)
#define                                 TU16AERS4_bit       _BIT_ACCESS(TU16AERS,4)
// PIE5<TU16AIE>
extern volatile __bit                   TU16AIE             __at(0x2562);	// @ (0x4AC * 8 + 2)
#define                                 TU16AIE_bit         _BIT_ACCESS(PIE5,2)
// PIR5<TU16AIF>
extern volatile __bit                   TU16AIF             __at(0x25BA);	// @ (0x4B7 * 8 + 2)
#define                                 TU16AIF_bit         _BIT_ACCESS(PIR5,2)
// IPR5<TU16AIP>
extern volatile __bit                   TU16AIP             __at(0x250A);	// @ (0x4A1 * 8 + 2)
#define                                 TU16AIP_bit         _BIT_ACCESS(IPR5,2)
// TU16ACON1<TU16ALIMIT>
extern volatile __bit                   TU16ALIMIT          __at(0x1D0C);	// @ (0x3A1 * 8 + 4)
#define                                 TU16ALIMIT_bit      _BIT_ACCESS(TU16ACON1,4)
// PMD6<TU16AMD>
extern volatile __bit                   TU16AMD             __at(0x340);	// @ (0x68 * 8 + 0)
#define                                 TU16AMD_bit         _BIT_ACCESS(PMD6,0)
// TU16ACON0<TU16AOM>
extern volatile __bit                   TU16AOM             __at(0x1D05);	// @ (0x3A0 * 8 + 5)
#define                                 TU16AOM_bit         _BIT_ACCESS(TU16ACON0,5)
// TU16ACON0<TU16AON>
extern volatile __bit                   TU16AON             __at(0x1D07);	// @ (0x3A0 * 8 + 7)
#define                                 TU16AON_bit         _BIT_ACCESS(TU16ACON0,7)
// TU16ACON0<TU16AOPOL>
extern volatile __bit                   TU16AOPOL           __at(0x1D04);	// @ (0x3A0 * 8 + 4)
#define                                 TU16AOPOL_bit       _BIT_ACCESS(TU16ACON0,4)
// TU16APRL<TU16APR0>
extern volatile __bit                   TU16APR0            __at(0x1D30);	// @ (0x3A6 * 8 + 0)
#define                                 TU16APR0_bit        _BIT_ACCESS(TU16APRL,0)
// TU16APRL<TU16APR1>
extern volatile __bit                   TU16APR1            __at(0x1D31);	// @ (0x3A6 * 8 + 1)
#define                                 TU16APR1_bit        _BIT_ACCESS(TU16APRL,1)
// TU16APRH<TU16APR10>
extern volatile __bit                   TU16APR10           __at(0x1D3A);	// @ (0x3A7 * 8 + 2)
#define                                 TU16APR10_bit       _BIT_ACCESS(TU16APRH,2)
// TU16APRH<TU16APR11>
extern volatile __bit                   TU16APR11           __at(0x1D3B);	// @ (0x3A7 * 8 + 3)
#define                                 TU16APR11_bit       _BIT_ACCESS(TU16APRH,3)
// TU16APRH<TU16APR12>
extern volatile __bit                   TU16APR12           __at(0x1D3C);	// @ (0x3A7 * 8 + 4)
#define                                 TU16APR12_bit       _BIT_ACCESS(TU16APRH,4)
// TU16APRH<TU16APR13>
extern volatile __bit                   TU16APR13           __at(0x1D3D);	// @ (0x3A7 * 8 + 5)
#define                                 TU16APR13_bit       _BIT_ACCESS(TU16APRH,5)
// TU16APRH<TU16APR14>
extern volatile __bit                   TU16APR14           __at(0x1D3E);	// @ (0x3A7 * 8 + 6)
#define                                 TU16APR14_bit       _BIT_ACCESS(TU16APRH,6)
// TU16APRH<TU16APR15>
extern volatile __bit                   TU16APR15           __at(0x1D3F);	// @ (0x3A7 * 8 + 7)
#define                                 TU16APR15_bit       _BIT_ACCESS(TU16APRH,7)
// TU16APRL<TU16APR2>
extern volatile __bit                   TU16APR2            __at(0x1D32);	// @ (0x3A6 * 8 + 2)
#define                                 TU16APR2_bit        _BIT_ACCESS(TU16APRL,2)
// TU16APRL<TU16APR3>
extern volatile __bit                   TU16APR3            __at(0x1D33);	// @ (0x3A6 * 8 + 3)
#define                                 TU16APR3_bit        _BIT_ACCESS(TU16APRL,3)
// TU16APRL<TU16APR4>
extern volatile __bit                   TU16APR4            __at(0x1D34);	// @ (0x3A6 * 8 + 4)
#define                                 TU16APR4_bit        _BIT_ACCESS(TU16APRL,4)
// TU16APRL<TU16APR5>
extern volatile __bit                   TU16APR5            __at(0x1D35);	// @ (0x3A6 * 8 + 5)
#define                                 TU16APR5_bit        _BIT_ACCESS(TU16APRL,5)
// TU16APRL<TU16APR6>
extern volatile __bit                   TU16APR6            __at(0x1D36);	// @ (0x3A6 * 8 + 6)
#define                                 TU16APR6_bit        _BIT_ACCESS(TU16APRL,6)
// TU16APRL<TU16APR7>
extern volatile __bit                   TU16APR7            __at(0x1D37);	// @ (0x3A6 * 8 + 7)
#define                                 TU16APR7_bit        _BIT_ACCESS(TU16APRL,7)
// TU16APRH<TU16APR8>
extern volatile __bit                   TU16APR8            __at(0x1D38);	// @ (0x3A7 * 8 + 0)
#define                                 TU16APR8_bit        _BIT_ACCESS(TU16APRH,0)
// TU16APRH<TU16APR9>
extern volatile __bit                   TU16APR9            __at(0x1D39);	// @ (0x3A7 * 8 + 1)
#define                                 TU16APR9_bit        _BIT_ACCESS(TU16APRH,1)
// TU16APRH<TU16APRH0>
extern volatile __bit                   TU16APRH0           __at(0x1D38);	// @ (0x3A7 * 8 + 0)
#define                                 TU16APRH0_bit       _BIT_ACCESS(TU16APRH,0)
// TU16APRH<TU16APRH1>
extern volatile __bit                   TU16APRH1           __at(0x1D39);	// @ (0x3A7 * 8 + 1)
#define                                 TU16APRH1_bit       _BIT_ACCESS(TU16APRH,1)
// TU16APRH<TU16APRH2>
extern volatile __bit                   TU16APRH2           __at(0x1D3A);	// @ (0x3A7 * 8 + 2)
#define                                 TU16APRH2_bit       _BIT_ACCESS(TU16APRH,2)
// TU16APRH<TU16APRH3>
extern volatile __bit                   TU16APRH3           __at(0x1D3B);	// @ (0x3A7 * 8 + 3)
#define                                 TU16APRH3_bit       _BIT_ACCESS(TU16APRH,3)
// TU16APRH<TU16APRH4>
extern volatile __bit                   TU16APRH4           __at(0x1D3C);	// @ (0x3A7 * 8 + 4)
#define                                 TU16APRH4_bit       _BIT_ACCESS(TU16APRH,4)
// TU16APRH<TU16APRH5>
extern volatile __bit                   TU16APRH5           __at(0x1D3D);	// @ (0x3A7 * 8 + 5)
#define                                 TU16APRH5_bit       _BIT_ACCESS(TU16APRH,5)
// TU16APRH<TU16APRH6>
extern volatile __bit                   TU16APRH6           __at(0x1D3E);	// @ (0x3A7 * 8 + 6)
#define                                 TU16APRH6_bit       _BIT_ACCESS(TU16APRH,6)
// TU16APRH<TU16APRH7>
extern volatile __bit                   TU16APRH7           __at(0x1D3F);	// @ (0x3A7 * 8 + 7)
#define                                 TU16APRH7_bit       _BIT_ACCESS(TU16APRH,7)
// TU16ACON0<TU16APRIE>
extern volatile __bit                   TU16APRIE           __at(0x1D02);	// @ (0x3A0 * 8 + 2)
#define                                 TU16APRIE_bit       _BIT_ACCESS(TU16ACON0,2)
// TU16ACON1<TU16APRIF>
extern volatile __bit                   TU16APRIF           __at(0x1D0A);	// @ (0x3A1 * 8 + 2)
#define                                 TU16APRIF_bit       _BIT_ACCESS(TU16ACON1,2)
// TU16APRL<TU16APRL0>
extern volatile __bit                   TU16APRL0           __at(0x1D30);	// @ (0x3A6 * 8 + 0)
#define                                 TU16APRL0_bit       _BIT_ACCESS(TU16APRL,0)
// TU16APRL<TU16APRL1>
extern volatile __bit                   TU16APRL1           __at(0x1D31);	// @ (0x3A6 * 8 + 1)
#define                                 TU16APRL1_bit       _BIT_ACCESS(TU16APRL,1)
// TU16APRL<TU16APRL2>
extern volatile __bit                   TU16APRL2           __at(0x1D32);	// @ (0x3A6 * 8 + 2)
#define                                 TU16APRL2_bit       _BIT_ACCESS(TU16APRL,2)
// TU16APRL<TU16APRL3>
extern volatile __bit                   TU16APRL3           __at(0x1D33);	// @ (0x3A6 * 8 + 3)
#define                                 TU16APRL3_bit       _BIT_ACCESS(TU16APRL,3)
// TU16APRL<TU16APRL4>
extern volatile __bit                   TU16APRL4           __at(0x1D34);	// @ (0x3A6 * 8 + 4)
#define                                 TU16APRL4_bit       _BIT_ACCESS(TU16APRL,4)
// TU16APRL<TU16APRL5>
extern volatile __bit                   TU16APRL5           __at(0x1D35);	// @ (0x3A6 * 8 + 5)
#define                                 TU16APRL5_bit       _BIT_ACCESS(TU16APRL,5)
// TU16APRL<TU16APRL6>
extern volatile __bit                   TU16APRL6           __at(0x1D36);	// @ (0x3A6 * 8 + 6)
#define                                 TU16APRL6_bit       _BIT_ACCESS(TU16APRL,6)
// TU16APRL<TU16APRL7>
extern volatile __bit                   TU16APRL7           __at(0x1D37);	// @ (0x3A6 * 8 + 7)
#define                                 TU16APRL7_bit       _BIT_ACCESS(TU16APRL,7)
// TU16APS<TU16APS0>
extern volatile __bit                   TU16APS0            __at(0x1D18);	// @ (0x3A3 * 8 + 0)
#define                                 TU16APS0_bit        _BIT_ACCESS(TU16APS,0)
// TU16APS<TU16APS1>
extern volatile __bit                   TU16APS1            __at(0x1D19);	// @ (0x3A3 * 8 + 1)
#define                                 TU16APS1_bit        _BIT_ACCESS(TU16APS,1)
// TU16APS<TU16APS2>
extern volatile __bit                   TU16APS2            __at(0x1D1A);	// @ (0x3A3 * 8 + 2)
#define                                 TU16APS2_bit        _BIT_ACCESS(TU16APS,2)
// TU16APS<TU16APS3>
extern volatile __bit                   TU16APS3            __at(0x1D1B);	// @ (0x3A3 * 8 + 3)
#define                                 TU16APS3_bit        _BIT_ACCESS(TU16APS,3)
// TU16APS<TU16APS4>
extern volatile __bit                   TU16APS4            __at(0x1D1C);	// @ (0x3A3 * 8 + 4)
#define                                 TU16APS4_bit        _BIT_ACCESS(TU16APS,4)
// TU16APS<TU16APS5>
extern volatile __bit                   TU16APS5            __at(0x1D1D);	// @ (0x3A3 * 8 + 5)
#define                                 TU16APS5_bit        _BIT_ACCESS(TU16APS,5)
// TU16APS<TU16APS6>
extern volatile __bit                   TU16APS6            __at(0x1D1E);	// @ (0x3A3 * 8 + 6)
#define                                 TU16APS6_bit        _BIT_ACCESS(TU16APS,6)
// TU16APS<TU16APS7>
extern volatile __bit                   TU16APS7            __at(0x1D1F);	// @ (0x3A3 * 8 + 7)
#define                                 TU16APS7_bit        _BIT_ACCESS(TU16APS,7)
// TU16ACON0<TU16ARDSEL>
extern volatile __bit                   TU16ARDSEL          __at(0x1D03);	// @ (0x3A0 * 8 + 3)
#define                                 TU16ARDSEL_bit      _BIT_ACCESS(TU16ACON0,3)
// TU16AHLT<TU16ARESET0>
extern volatile __bit                   TU16ARESET0         __at(0x1D12);	// @ (0x3A2 * 8 + 2)
#define                                 TU16ARESET0_bit     _BIT_ACCESS(TU16AHLT,2)
// TU16AHLT<TU16ARESET1>
extern volatile __bit                   TU16ARESET1         __at(0x1D13);	// @ (0x3A2 * 8 + 3)
#define                                 TU16ARESET1_bit     _BIT_ACCESS(TU16AHLT,3)
// TU16ACON1<TU16ARUN>
extern volatile __bit                   TU16ARUN            __at(0x1D0F);	// @ (0x3A1 * 8 + 7)
#define                                 TU16ARUN_bit        _BIT_ACCESS(TU16ACON1,7)
// TU16AHLT<TU16ASTART0>
extern volatile __bit                   TU16ASTART0         __at(0x1D14);	// @ (0x3A2 * 8 + 4)
#define                                 TU16ASTART0_bit     _BIT_ACCESS(TU16AHLT,4)
// TU16AHLT<TU16ASTART1>
extern volatile __bit                   TU16ASTART1         __at(0x1D15);	// @ (0x3A2 * 8 + 5)
#define                                 TU16ASTART1_bit     _BIT_ACCESS(TU16AHLT,5)
// TU16AHLT<TU16ASTOP0>
extern volatile __bit                   TU16ASTOP0          __at(0x1D10);	// @ (0x3A2 * 8 + 0)
#define                                 TU16ASTOP0_bit      _BIT_ACCESS(TU16AHLT,0)
// TU16AHLT<TU16ASTOP1>
extern volatile __bit                   TU16ASTOP1          __at(0x1D11);	// @ (0x3A2 * 8 + 1)
#define                                 TU16ASTOP1_bit      _BIT_ACCESS(TU16AHLT,1)
// TU16ATMRL<TU16ATMR0>
extern volatile __bit                   TU16ATMR0           __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 TU16ATMR0_bit       _BIT_ACCESS(TU16ATMRL,0)
// TU16ATMRL<TU16ATMR1>
extern volatile __bit                   TU16ATMR1           __at(0x1D21);	// @ (0x3A4 * 8 + 1)
#define                                 TU16ATMR1_bit       _BIT_ACCESS(TU16ATMRL,1)
// TU16ATMRH<TU16ATMR10>
extern volatile __bit                   TU16ATMR10          __at(0x1D2A);	// @ (0x3A5 * 8 + 2)
#define                                 TU16ATMR10_bit      _BIT_ACCESS(TU16ATMRH,2)
// TU16ATMRH<TU16ATMR11>
extern volatile __bit                   TU16ATMR11          __at(0x1D2B);	// @ (0x3A5 * 8 + 3)
#define                                 TU16ATMR11_bit      _BIT_ACCESS(TU16ATMRH,3)
// TU16ATMRH<TU16ATMR12>
extern volatile __bit                   TU16ATMR12          __at(0x1D2C);	// @ (0x3A5 * 8 + 4)
#define                                 TU16ATMR12_bit      _BIT_ACCESS(TU16ATMRH,4)
// TU16ATMRH<TU16ATMR13>
extern volatile __bit                   TU16ATMR13          __at(0x1D2D);	// @ (0x3A5 * 8 + 5)
#define                                 TU16ATMR13_bit      _BIT_ACCESS(TU16ATMRH,5)
// TU16ATMRH<TU16ATMR14>
extern volatile __bit                   TU16ATMR14          __at(0x1D2E);	// @ (0x3A5 * 8 + 6)
#define                                 TU16ATMR14_bit      _BIT_ACCESS(TU16ATMRH,6)
// TU16ATMRH<TU16ATMR15>
extern volatile __bit                   TU16ATMR15          __at(0x1D2F);	// @ (0x3A5 * 8 + 7)
#define                                 TU16ATMR15_bit      _BIT_ACCESS(TU16ATMRH,7)
// TU16ATMRL<TU16ATMR2>
extern volatile __bit                   TU16ATMR2           __at(0x1D22);	// @ (0x3A4 * 8 + 2)
#define                                 TU16ATMR2_bit       _BIT_ACCESS(TU16ATMRL,2)
// TU16ATMRL<TU16ATMR3>
extern volatile __bit                   TU16ATMR3           __at(0x1D23);	// @ (0x3A4 * 8 + 3)
#define                                 TU16ATMR3_bit       _BIT_ACCESS(TU16ATMRL,3)
// TU16ATMRL<TU16ATMR4>
extern volatile __bit                   TU16ATMR4           __at(0x1D24);	// @ (0x3A4 * 8 + 4)
#define                                 TU16ATMR4_bit       _BIT_ACCESS(TU16ATMRL,4)
// TU16ATMRL<TU16ATMR5>
extern volatile __bit                   TU16ATMR5           __at(0x1D25);	// @ (0x3A4 * 8 + 5)
#define                                 TU16ATMR5_bit       _BIT_ACCESS(TU16ATMRL,5)
// TU16ATMRL<TU16ATMR6>
extern volatile __bit                   TU16ATMR6           __at(0x1D26);	// @ (0x3A4 * 8 + 6)
#define                                 TU16ATMR6_bit       _BIT_ACCESS(TU16ATMRL,6)
// TU16ATMRL<TU16ATMR7>
extern volatile __bit                   TU16ATMR7           __at(0x1D27);	// @ (0x3A4 * 8 + 7)
#define                                 TU16ATMR7_bit       _BIT_ACCESS(TU16ATMRL,7)
// TU16ATMRH<TU16ATMR8>
extern volatile __bit                   TU16ATMR8           __at(0x1D28);	// @ (0x3A5 * 8 + 0)
#define                                 TU16ATMR8_bit       _BIT_ACCESS(TU16ATMRH,0)
// TU16ATMRH<TU16ATMR9>
extern volatile __bit                   TU16ATMR9           __at(0x1D29);	// @ (0x3A5 * 8 + 1)
#define                                 TU16ATMR9_bit       _BIT_ACCESS(TU16ATMRH,1)
// TU16ATMRH<TU16ATMRH0>
extern volatile __bit                   TU16ATMRH0          __at(0x1D28);	// @ (0x3A5 * 8 + 0)
#define                                 TU16ATMRH0_bit      _BIT_ACCESS(TU16ATMRH,0)
// TU16ATMRH<TU16ATMRH1>
extern volatile __bit                   TU16ATMRH1          __at(0x1D29);	// @ (0x3A5 * 8 + 1)
#define                                 TU16ATMRH1_bit      _BIT_ACCESS(TU16ATMRH,1)
// TU16ATMRH<TU16ATMRH2>
extern volatile __bit                   TU16ATMRH2          __at(0x1D2A);	// @ (0x3A5 * 8 + 2)
#define                                 TU16ATMRH2_bit      _BIT_ACCESS(TU16ATMRH,2)
// TU16ATMRH<TU16ATMRH3>
extern volatile __bit                   TU16ATMRH3          __at(0x1D2B);	// @ (0x3A5 * 8 + 3)
#define                                 TU16ATMRH3_bit      _BIT_ACCESS(TU16ATMRH,3)
// TU16ATMRH<TU16ATMRH4>
extern volatile __bit                   TU16ATMRH4          __at(0x1D2C);	// @ (0x3A5 * 8 + 4)
#define                                 TU16ATMRH4_bit      _BIT_ACCESS(TU16ATMRH,4)
// TU16ATMRH<TU16ATMRH5>
extern volatile __bit                   TU16ATMRH5          __at(0x1D2D);	// @ (0x3A5 * 8 + 5)
#define                                 TU16ATMRH5_bit      _BIT_ACCESS(TU16ATMRH,5)
// TU16ATMRH<TU16ATMRH6>
extern volatile __bit                   TU16ATMRH6          __at(0x1D2E);	// @ (0x3A5 * 8 + 6)
#define                                 TU16ATMRH6_bit      _BIT_ACCESS(TU16ATMRH,6)
// TU16ATMRH<TU16ATMRH7>
extern volatile __bit                   TU16ATMRH7          __at(0x1D2F);	// @ (0x3A5 * 8 + 7)
#define                                 TU16ATMRH7_bit      _BIT_ACCESS(TU16ATMRH,7)
// TU16ATMRL<TU16ATMRL0>
extern volatile __bit                   TU16ATMRL0          __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 TU16ATMRL0_bit      _BIT_ACCESS(TU16ATMRL,0)
// TU16ATMRL<TU16ATMRL1>
